stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_ll_pwr.h
/**
  ******************************************************************************
  * @file    stm32wbaxx_ll_pwr.h
  * @author  MCD Application Team
  * @brief   Header file of PWR LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WBAxx_LL_PWR_H
#define STM32WBAxx_LL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32wbaxx.h"

/** @addtogroup STM32WBAxx_LL_Driver
  * @{
  */

#if defined(PWR)

/** @defgroup PWR_LL PWR
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/** @defgroup PWR_LL_Exported_Constants PWR Exported Constants
  * @{
  */

/** @defgroup PWR_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_WriteReg function
  * @{
  */
#define LL_PWR_SR_CSSF         PWR_SR_CSSF     /*!< Clear Stop and Standby flags */
#define LL_PWR_WUSCR_CWUF1     PWR_WUSCR_CWUF1 /*!< Clear Wakeup flag 1          */
#define LL_PWR_WUSCR_CWUF2     PWR_WUSCR_CWUF2 /*!< Clear Wakeup flag 2          */
#define LL_PWR_WUSCR_CWUF3     PWR_WUSCR_CWUF3 /*!< Clear Wakeup flag 3          */
#define LL_PWR_WUSCR_CWUF4     PWR_WUSCR_CWUF4 /*!< Clear Wakeup flag 4          */
#if !defined(PWR_STOP3_SUPPORT)
#define LL_PWR_WUSCR_CWUF5     PWR_WUSCR_CWUF5 /*!< Clear Wakeup flag 5          */
#endif /* !defined(PWR_STOP3_SUPPORT) */
#define LL_PWR_WUSCR_CWUF6     PWR_WUSCR_CWUF6 /*!< Clear Wakeup flag 6          */
#define LL_PWR_WUSCR_CWUF7     PWR_WUSCR_CWUF7 /*!< Clear Wakeup flag 7          */
#define LL_PWR_WUSCR_CWUF8     PWR_WUSCR_CWUF8 /*!< Clear Wakeup flag 8          */
#define LL_PWR_WUSCR_CWUF_ALL  PWR_WUSCR_CWUF  /*!< Clear all Wakeup flags       */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_ReadReg function
  * @{
  */
#define LL_PWR_FLAG_VOSRDY    PWR_VOSR_VOSRDY     /*!< Voltage scaling ready flag                               */
#define LL_PWR_FLAG_STOPF     PWR_SR_STOPF        /*!< Stop flag                                                */
#define LL_PWR_FLAG_SBF       PWR_SR_SBF          /*!< Standby flag                                             */
#define LL_PWR_FLAG_ACTVOSRDY PWR_SVMSR_ACTVOSRDY /*!< Currently applied VOS ready flag                         */
#define LL_PWR_FLAG_PVDO      PWR_SVMSR_PVDO      /*!< VDD voltage detector output flag                         */
#define LL_PWR_FLAG_REGS      PWR_SVMSR_REGS      /*!< Regulator selection flag                                 */

#define LL_PWR_WAKEUP_FLAG1   PWR_WUSR_WUF1       /*!< Wakeup flag 1 */
#define LL_PWR_WAKEUP_FLAG2   PWR_WUSR_WUF2       /*!< Wakeup flag 2 */
#define LL_PWR_WAKEUP_FLAG3   PWR_WUSR_WUF3       /*!< Wakeup flag 3 */
#define LL_PWR_WAKEUP_FLAG4   PWR_WUSR_WUF4       /*!< Wakeup flag 4 */
#if !defined(PWR_STOP3_SUPPORT)
#define LL_PWR_WAKEUP_FLAG5   PWR_WUSR_WUF5       /*!< Wakeup flag 5 */
#endif /* !defined(PWR_STOP3_SUPPORT) */
#define LL_PWR_WAKEUP_FLAG6   PWR_WUSR_WUF6       /*!< Wakeup flag 6 */
#define LL_PWR_WAKEUP_FLAG7   PWR_WUSR_WUF7       /*!< Wakeup flag 7 */
#define LL_PWR_WAKEUP_FLAG8   PWR_WUSR_WUF8       /*!< Wakeup flag 8 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_LOW_POWER_MODE_SELECTION  Low Power Mode Selection
  * @{
  */
#define LL_PWR_MODE_STOP0    0U                                 /*!< Stop 0 mode   */
#define LL_PWR_MODE_STOP1    PWR_CR1_LPMS_0                     /*!< Stop 1 mode   */
#if defined(PWR_STOP2_SUPPORT)
#define LL_PWR_MODE_STOP2    PWR_CR1_LPMS_1                     /*!< Stop 2 mode   */
#endif /* defined(PWR_STOP2_SUPPORT) */
#if defined(PWR_STOP3_SUPPORT)
#define LL_PWR_MODE_STOP3    (PWR_CR1_LPMS_1 | PWR_CR1_LPMS_0)  /*!< Stop 3 mode   */
#endif /* defined(PWR_STOP3_SUPPORT) */
#define LL_PWR_MODE_STANDBY  PWR_CR1_LPMS_2                     /*!< Standby mode  */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SRAM1_SB_RETENTION PWR SRAM1 Retention in Standby Mode
  * @{
  */
#define LL_PWR_SRAM1_SB_NO_RETENTION          0U               /*!< SRAM1 no retention in Standby mode         */
#if defined(PWR_STOP2_SUPPORT)
#define LL_PWR_SRAM1_SB_PAGE1_RETENTION       PWR_CR1_R1RSB1   /*!< SRAM1 page 1 retention in Standby mode     */
#if defined(PWR_STOP3_SUPPORT)
#define LL_PWR_SRAM1_SB_FULL_RETENTION        PWR_CR1_R1RSB1   /*!< SRAM1 all pages retention in Standby mode  */
#else
#define LL_PWR_SRAM1_SB_PAGE2_RETENTION       PWR_CR1_R1RSB2   /*!< SRAM1 page 2 retention in Standby mode     */
#define LL_PWR_SRAM1_SB_PAGE3_RETENTION       PWR_CR1_R1RSB3   /*!< SRAM1 page 3 retention in Standby mode     */
#define LL_PWR_SRAM1_SB_PAGE4_RETENTION       PWR_CR1_R1RSB4   /*!< SRAM1 page 4 retention in Standby mode     */
#define LL_PWR_SRAM1_SB_PAGE567_RETENTION     PWR_CR1_R1RSB567 /*!< SRAM1 page 5-6-7 retention in Standby mode */
#define LL_PWR_SRAM1_SB_FULL_RETENTION        (PWR_CR1_R1RSB1 | PWR_CR1_R1RSB2 | PWR_CR1_R1RSB3 |\
                                               PWR_CR1_R1RSB4 | PWR_CR1_R1RSB567)
#endif /* defined(PWR_STOP3_SUPPORT) */
#else/*!< SRAM1 all pages retention in Standby mode */
#define LL_PWR_SRAM1_SB_FULL_RETENTION        PWR_CR1_R1RSB1   /*!< SRAM1 all pages retention in Standby mode      */
#endif /* defined(PWR_STOP2_SUPPORT) */
/**
  * @}
  */

