stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_ll_pwr.h
/** @defgroup PWR_LL_EC_SRAM2_SB_RETENTION PWR SRAM2 Retention in Standby Mode
  * @{
  */
#define LL_PWR_SRAM2_SB_NO_RETENTION    0U                                /*!< SRAM2 no retention in Standby mode         */
#if !defined(PWR_STOP3_SUPPORT)
#define LL_PWR_SRAM2_SB_FULL_RETENTION  PWR_CR1_R2RSB1                    /*!< SRAM2 all pages retention in Standby mode  */
#else
#define LL_PWR_SRAM2_SB_PAGE1_RETENTION PWR_CR1_R2RSB1                    /*!< SRAM2 page1 retention in Standby mode      */
#define LL_PWR_SRAM2_SB_PAGE2_RETENTION PWR_CR1_R2RSB2                    /*!< SRAM2 page2 retention in Standby mode      */
#define LL_PWR_SRAM2_SB_FULL_RETENTION  (PWR_CR1_R2RSB1 | PWR_CR1_R2RSB2) /*!< SRAM2 all pages retention in Standby mode  */
#endif /* !defined(PWR_STOP3_SUPPORT) */
/**
  * @}
  */

#if defined(PWR_STOP3_SUPPORT)
/** @defgroup PWR_LL_EC_RTC_SB_RETENTION RTC and TAMP retention in Standby mode
  * @{
  */
#define LL_PWR_RTC_SB_NO_RETENTION    0U              /*!< RTC and TAMP content not retained in Standby mode */
#define LL_PWR_RTC_SB_FULL_RETENTION  PWR_CR1_RTCRSB  /*!< RTC and TAMP content retained in Standby mode */
/**
  * @}
  */
 #endif /* defined(PWR_STOP3_SUPPORT) */

/** @defgroup PWR_LL_EC_RADIO_SB_RETENTION PWR RADIO SRAMs and Sleep Clock Retention in Standby Mode
  * @{
  */
#define LL_PWR_RADIO_SB_NO_RETENTION    0U                /*!< 2.4 GHz RADIO SRAMs and sleep timer content not retained in Standby mode */
#define LL_PWR_RADIO_SB_FULL_RETENTION  PWR_CR1_RADIORSB  /*!< 2.4 GHz RADIO SRAMs and sleep timer content retained in Standby mode     */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SRAM1_STOP_RETENTION PWR SRAM1 Retention in Stop Mode
  * @{
  */
#define LL_PWR_SRAM1_STOP_NO_RETENTION       0U                   /*!< SRAM1 no retention in Stop mode        */
#if defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT)
#define LL_PWR_SRAM1_STOP_PAGE1_RETENTION    PWR_CR2_SRAM1PDS1    /*!< SRAM1 page1 retention in Stop mode */
#define LL_PWR_SRAM1_STOP_PAGE2_RETENTION    PWR_CR2_SRAM1PDS2    /*!< SRAM1 page2 retention in Stop mode */
#define LL_PWR_SRAM1_STOP_PAGE3_RETENTION    PWR_CR2_SRAM1PDS3    /*!< SRAM1 page3 retention in Stop mode */
#define LL_PWR_SRAM1_STOP_PAGE4_RETENTION    PWR_CR2_SRAM1PDS4    /*!< SRAM1 page4 retention in Stop mode */
#define LL_PWR_SRAM1_STOP_PAGE567_RETENTION  PWR_CR2_SRAM1PDS567  /*!< SRAM1 page4 retention in Stop mode */
#define LL_PWR_SRAM1_STOP_FULL_RETENTION     (PWR_CR2_SRAM1PDS1 | PWR_CR2_SRAM1PDS2 | PWR_CR2_SRAM1PDS3 |\
                                              PWR_CR2_SRAM1PDS4 | PWR_CR2_SRAM1PDS567)
/*!< SRAM1 all pages retention in Stop mode */
#else
#define LL_PWR_SRAM1_STOP_FULL_RETENTION  PWR_CR2_SRAM1PDS1   /*!< SRAM1 all pages retention in Stop mode */
#endif /* defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT) */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SRAM2_STOP_RETENTION PWR SRAM2 Retention in Stop Mode
  * @{
  */
#define LL_PWR_SRAM2_STOP_NO_RETENTION    0U                                      /*!< SRAM2 no retention in Stop mode        */
#if defined(PWR_STOP3_SUPPORT)
#define LL_PWR_SRAM2_STOP_PAGE1_RETENTION PWR_CR2_SRAM2PDS1                       /*!< SRAM2 page1 retention in Stop mode */
#define LL_PWR_SRAM2_STOP_PAGE2_RETENTION PWR_CR2_SRAM2PDS2                       /*!< SRAM2 page2 retention in Stop mode */
#define LL_PWR_SRAM2_STOP_FULL_RETENTION  (PWR_CR2_SRAM2PDS1 | PWR_CR2_SRAM2PDS2) /*!< SRAM2 all pages retention in Stop mode */
#else
#define LL_PWR_SRAM2_STOP_FULL_RETENTION  PWR_CR2_SRAM2PDS1                       /*!< SRAM2 all pages retention in Stop mode */
#endif /* defined(PWR_STOP3_SUPPORT) */
/**
  * @}
  */

#if defined (PWR_CR2_ICRAMPDS)
/** @defgroup PWR_LL_EC_ICACHERAM_STOP_RETENTION PWR ICACHE SRAM Retention in Stop Mode
  * @{
  */
#define LL_PWR_ICACHERAM_STOP_NO_RETENTION    0U                  /*!< ICACHE SRAM no retention in Stop mode    */
#define LL_PWR_ICACHERAM_STOP_FULL_RETENTION  PWR_CR2_ICRAMPDS    /*!< ICACHE SRAM full retention in Stop mode */
/**
  * @}
  */
#endif /* PWR_CR2_ICRAMPDS */

#if defined(PWR_STOP2_SUPPORT)
#if defined(USB_OTG_HS)
/** @defgroup PWR_LL_EC_USB_OTG_HS_SRAM_STOP_RETENTION PWR USB_OTG_HS SRAM Retention in Stop Mode
  * @{
  */
#define LL_PWR_USB_OTG_HS_SRAM_STOP_NO_RETENTION    0U               /*!< USB_OTG_HS SRAM no retention in Stop mode   */
#define LL_PWR_USB_OTG_HS_SRAM_STOP_FULL_RETENTION  PWR_CR2_PRAMPDS  /*!< USB_OTG_HS SRAM full retention in Stop mode */
/**
  * @}
  */
#else
 /** @defgroup PWR_LL_EC_USB_SRAM_STOP_RETENTION PWR USB SRAM Retention in Stop Mode
  * @{
  */
#define LL_PWR_USB_SRAM_STOP_NO_RETENTION    0U               /*!< USB SRAM no retention in Stop mode   */
#define LL_PWR_USB_SRAM_STOP_FULL_RETENTION  PWR_CR2_PRAMPDS  /*!< USB SRAM full retention in Stop mode */
/**
  * @}
  */
#endif /* defined(USB_OTG_HS) */

/** @defgroup PWR_LL_EC_PKARAM_STOP_RETENTION PWR PKA SRAM Retention in Stop Mode
  * @{
  */
#define LL_PWR_PKARAM_STOP_NO_RETENTION    0U                 /*!< PKA SRAM no retention in Stop mode   */
#define LL_PWR_PKARAM_STOP_FULL_RETENTION  PWR_CR2_PKARAMPDS  /*!< PKA SRAM full retention in Stop mode */
/**
  * @}
  */
#endif /* defined(PWR_STOP2_SUPPORT) */
/** @defgroup PWR_LL_EC_SMPS_PWM_MODE PWR SMPS PWM mode
  * @{
  */
#define LL_PWR_SMPS_NO_PWM_MODE   0U           /*!< SMPS PWM mode disabled (high-efficiency mode) */
#define LL_PWR_SMPS_PWM_MODE      PWR_CR2_FPWM /*!< SMPS PWM mode enabled (harmonic reduction)    */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_REGULATOR_SUPPLY_SELECTION PWR Regulator Supply Selection
  * @{
  */
#define LL_PWR_LDO_SUPPLY   0U             /*!< LDO regulator supply  */
#define LL_PWR_SMPS_SUPPLY  PWR_CR3_REGSEL /*!< SMPS regulator supply */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_REGULATOR_VDDHPA_SUPPLY_SELECTION PWR Regulator REG_VDDHPA input supply selection
  * @{
  */
#define LL_PWR_REG_VDDHPA_VDDRFPA_PIN   0U                    /*!< VDDRFPA pin selected as regulator REG_VDDHPA input supply */
#define LL_PWR_REG_VDDHPA_VDDRFPA_VDD11 PWR_RADIOSCR_REGPASEL /*!< Regulator REG_VDDHPA input supply selection between VDDRFPA and VDD11 dependent on requested regulated output voltage */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_RADIO_PHY_MODE PWR 2.4 GHz RADIO PHY operating mode
  * @{
  */
#define LL_PWR_RADIO_PHY_SLEEP_MODE   0U                   /*!< 2.4 GHz RADIO Sleep mode   */
#define LL_PWR_RADIO_PHY_STANDBY_MODE PWR_RADIOSCR_PHYMODE /*!< 2.4 GHz RADIO Standby mode */
/**
  * @}
  */

