stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_ll_pwr.h
/** @defgroup PWR_LL_Exported_Functions PWR Exported Functions
  * @{
  */

/** @defgroup PWR_LL_EF_CONFIGURATION PWR Configuration
  * @{
  */

/**
  * @brief  Set system power mode.
  * @rmtoll CR1           LPMS            LL_PWR_SetPowerMode
  * @param  Mode  This parameter can be one of the following values:
  *         @arg @ref LL_PWR_MODE_STOP0
  *         @arg @ref LL_PWR_MODE_STOP1
#if defined(PWR_STOP2_SUPPORT)
  *         @arg @ref LL_PWR_MODE_STOP2
#endif
#if defined(PWR_STOP3_SUPPORT)
  *         @arg @ref LL_PWR_MODE_STOP3
#endif
  *         @arg @ref LL_PWR_MODE_STANDBY
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPowerMode(uint32_t Mode)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_LPMS, Mode);
}

/**
  * @brief  Get system power mode.
  * @rmtoll CR1           LPMS            LL_PWR_GetPowerMode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_MODE_STOP0
  *         @arg @ref LL_PWR_MODE_STOP1
#if defined(PWR_STOP2_SUPPORT)
  *         @arg @ref LL_PWR_MODE_STOP2
#endif
#if defined(PWR_STOP3_SUPPORT)
  *         @arg @ref LL_PWR_MODE_STOP3
#endif
  *         @arg @ref LL_PWR_MODE_STANDBY
  */
__STATIC_INLINE uint32_t LL_PWR_GetPowerMode(void)
{
  return (READ_BIT(PWR->CR1, PWR_CR1_LPMS));
}

/**
  * @brief  Set the SRAM2 page(s) retention in Standby mode.
  * @rmtoll CR1           R2RSB1          LL_PWR_SetSRAM2SBRetention
#if defined(PWR_STOP3_SUPPORT)
  * @rmtoll CR1           R2RSB2          LL_PWR_SetSRAM2SBRetention
#endif
  * @param  SRAM2PageRetention  This parameter can be one of the following values:
  *                              @arg @ref LL_PWR_SRAM2_SB_NO_RETENTION
#if defined(PWR_STOP3_SUPPORT)
  *                              @arg @ref LL_PWR_SRAM2_SB_PAGE1_RETENTION
  *                              @arg @ref LL_PWR_SRAM2_SB_PAGE2_RETENTION
#endif
  *                              @arg @ref LL_PWR_SRAM2_SB_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSRAM2SBRetention(uint32_t SRAM2PageRetention)
{
#if defined(PWR_STOP3_SUPPORT)
  MODIFY_REG(PWR->CR1, (PWR_CR1_R2RSB1 | PWR_CR1_R2RSB2), SRAM2PageRetention);
#else
  MODIFY_REG(PWR->CR1, PWR_CR1_R2RSB1, SRAM2PageRetention);
#endif /* PWR_STOP3_SUPPORT */
}

/**
  * @brief  Get the SRAM2 page(s) retention in Standby mode.
  * @rmtoll CR1           R2RSB1          LL_PWR_GetSRAM2SBRetention
#if defined(PWR_STOP3_SUPPORT)
  * @rmtoll CR1           R2RSB2          LL_PWR_SetSRAM2SBRetention
#endif
  * @retval Returned value can be one of the following values:
  *                              @arg @ref LL_PWR_SRAM2_SB_NO_RETENTION
#if defined(PWR_STOP3_SUPPORT)
  *                              @arg @ref LL_PWR_SRAM2_SB_PAGE1_RETENTION
  *                              @arg @ref LL_PWR_SRAM2_SB_PAGE2_RETENTION
#endif
  *                              @arg @ref LL_PWR_SRAM2_SB_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetSRAM2SBRetention(void)
{
#if defined(PWR_STOP3_SUPPORT)
  return (READ_BIT(PWR->CR1, (PWR_CR1_R2RSB1 | PWR_CR1_R2RSB2)));
#else
  return (READ_BIT(PWR->CR1, PWR_CR1_R2RSB1));
#endif /* PWR_STOP3_SUPPORT */
}

/**
  * @brief  Set the SRAM1 page(s) retention in Standby mode.
  * @rmtoll CR1           R1RSB1          LL_PWR_SetSRAM1SBRetention
#if defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT)
  * @rmtoll CR1    R1RSB2       LL_PWR_SetSRAM1SBRetention
  * @rmtoll CR1    R1RSB3       LL_PWR_SetSRAM1SBRetention
  * @rmtoll CR1    R1RSB4       LL_PWR_SetSRAM1SBRetention
  * @rmtoll CR1    R1RSB5       LL_PWR_SetSRAM1SBRetention
  * @rmtoll CR1    R1RSB6       LL_PWR_SetSRAM1SBRetention
  * @rmtoll CR1    R1RSB7       LL_PWR_SetSRAM1SBRetention
#endif
  * @param  SRAM1PageRetention  This parameter can be one of the following values:
  *                              @arg @ref LL_PWR_SRAM1_SB_NO_RETENTION
#if defined(PWR_STOP2_SUPPORT)
                                 @arg @ref LL_PWR_SRAM1_SB_PAGE1_RETENTION
#if !defined(PWR_STOP3_SUPPORT)
                                 @arg @ref LL_PWR_SRAM1_SB_PAGE2_RETENTION
                                 @arg @ref LL_PWR_SRAM1_SB_PAGE3_RETENTION
                                 @arg @ref LL_PWR_SRAM1_SB_PAGE4_RETENTION
                                 @arg @ref LL_PWR_SRAM1_SB_PAGE567_RETENTION
#endif
#endif
  *                              @arg @ref LL_PWR_SRAM1_SB_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSRAM1SBRetention(uint32_t SRAM1PageRetention)
{
#if defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT)
  MODIFY_REG(PWR->CR1, (PWR_CR1_R1RSB1 |PWR_CR1_R1RSB2 |PWR_CR1_R1RSB3 |\
                        PWR_CR1_R1RSB4 | PWR_CR1_R1RSB567), SRAM1PageRetention);
#else
  MODIFY_REG(PWR->CR1, PWR_CR1_R1RSB1, SRAM1PageRetention);
#endif /* defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT) */
}

/**
  * @brief  Get the SRAM1 page(s) retention in Standby mode.
  * @rmtoll CR1           R1RSB1          LL_PWR_GetSRAM1SBRetention
#if defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT)
  * @rmtoll CR1    R1RSB2       LL_PWR_GetSRAM1SBRetention
  * @rmtoll CR1    R1RSB3       LL_PWR_GetSRAM1SBRetention
  * @rmtoll CR1    R1RSB4       LL_PWR_GetSRAM1SBRetention
  * @rmtoll CR1    R1RSB5       LL_PWR_GetSRAM1SBRetention
  * @rmtoll CR1    R1RSB6       LL_PWR_GetSRAM1SBRetention
  * @rmtoll CR1    R1RSB7       LL_PWR_GetSRAM1SBRetention
#endif
  * @retval Returned value can be one of the following values:
  *                              @arg @ref LL_PWR_SRAM1_SB_NO_RETENTION
#if defined(PWR_STOP2_SUPPORT)
                                 @arg @ref LL_PWR_SRAM1_SB_PAGE1_RETENTION
#if !defined(PWR_STOP3_SUPPORT)
                                 @arg @ref LL_PWR_SRAM1_SB_PAGE2_RETENTION
                                 @arg @ref LL_PWR_SRAM1_SB_PAGE3_RETENTION
                                 @arg @ref LL_PWR_SRAM1_SB_PAGE4_RETENTION
                                 @arg @ref LL_PWR_SRAM1_SB_PAGE567_RETENTION
#endif
#endif
#if !defined(PWR_STOP3_SUPPORT)
  *                              @arg @ref LL_PWR_SRAM1_SB_FULL_RETENTION
#endif
  */
__STATIC_INLINE uint32_t LL_PWR_GetSRAM1SBRetention(void)
{
#if defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT)
  return (READ_BIT(PWR->CR1, (PWR_CR1_R1RSB1 |PWR_CR1_R1RSB2 |PWR_CR1_R1RSB3 |\
                              PWR_CR1_R1RSB4 | PWR_CR1_R1RSB567)));
#else
  return (READ_BIT(PWR->CR1, PWR_CR1_R1RSB1));
#endif /* defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT) */
}
#if defined(PWR_STOP3_SUPPORT)
/**
  * @brief  Set the RTC/TAMP retention in Standby mode.
  * @rmtoll CR1           RTCRSB        LL_PWR_SetRTCSBRetention
  * @param  RadioRetention  This parameter can be one of the following values:
  *                              @arg @ref LL_PWR_RTC_SB_NO_RETENTION
  *                              @arg @ref LL_PWR_RTC_SB_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetRTCSBRetention(uint32_t RtcRetention)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_RTCRSB, RtcRetention);
}

/**
  * @brief  Get the Radio retention in Standby mode.
  * @rmtoll CR1           RTCRSB        LL_PWR_GetRTCSBRetention
  * @retval Returned value can be one of the following values:
  *                              @arg @ref LL_PWR_RTC_SB_NO_RETENTION
  *                              @arg @ref LL_PWR_RTC_SB_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetRTCSBRetention(void)
{
  return (READ_BIT(PWR->CR1, PWR_CR1_RTCRSB));
}
#endif /* defined(PWR_STOP3_SUPPORT) */

/**
  * @brief  Set the Radio retention in Standby mode.
  * @rmtoll CR1           RADIORSB        LL_PWR_SetRadioSBRetention
  * @param  RadioRetention  This parameter can be one of the following values:
  *                              @arg @ref LL_PWR_RADIO_SB_NO_RETENTION
  *                              @arg @ref LL_PWR_RADIO_SB_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetRadioSBRetention(uint32_t RadioRetention)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_RADIORSB, RadioRetention);
}

/**
  * @brief  Get the Radio retention in Standby mode.
  * @rmtoll CR1           RADIORSB        LL_PWR_GetRadioSBRetention
  * @retval Returned value can be one of the following values:
  *                              @arg @ref LL_PWR_RADIO_SB_NO_RETENTION
  *                              @arg @ref LL_PWR_RADIO_SB_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetRadioSBRetention(void)
{
  return (READ_BIT(PWR->CR1, PWR_CR1_RADIORSB));
}

/**
  * @brief  Enable BOR ultra low power mode.
  * @rmtoll CR1           UPLMEN          LL_PWR_EnableUltraLowPowerMode
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableUltraLowPowerMode(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_ULPMEN);
}

/**
  * @brief  Disable BOR ultra low-power mode.
  * @rmtoll CR1           UPLMEN          LL_PWR_DisableUltraLowPowerMode
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableUltraLowPowerMode(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_ULPMEN);
}

/**
  * @brief  Check if BOR ultra low power mode is enabled.
  * @rmtoll CR1           UPLMEN          LL_PWR_IsEnabledUltraLowPowerMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledUltraLowPowerMode(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_ULPMEN) == (PWR_CR1_ULPMEN)) ? 1UL : 0UL);
}


/**
  * @brief  Set the SRAM1 page(s) retention in Stop mode.
  * @rmtoll CR2           SRAM1PDS1       LL_PWR_SetSRAM1StopRetention
#if defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT)
  * @rmtoll CR2           SRAM1PDS2       LL_PWR_SetSRAM1StopRetention
  * @rmtoll CR2           SRAM1PDS3       LL_PWR_SetSRAM1StopRetention
  * @rmtoll CR2           SRAM1PDS4       LL_PWR_SetSRAM1StopRetention
  * @rmtoll CR2           SRAM1PDS567     LL_PWR_SetSRAM1StopRetention
#endif
  * @param  SRAM1PageRetention  This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SRAM1_STOP_NO_RETENTION
#if defined(PWR_STOP2_SUPPORT)
            @arg @ref LL_PWR_SRAM1_STOP_PAGE1_RETENTION
#if !defined(PWR_STOP3_SUPPORT)
            @arg @ref LL_PWR_SRAM1_STOP_PAGE2_RETENTION
            @arg @ref LL_PWR_SRAM1_STOP_PAGE3_RETENTION
            @arg @ref LL_PWR_SRAM1_STOP_PAGE4_RETENTION
            @arg @ref LL_PWR_SRAM1_STOP_PAGE567_RETENTION
#endif
#endif
  *         @arg @ref LL_PWR_SRAM1_STOP_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSRAM1StopRetention(uint32_t SRAM1PageRetention)
{
#if defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT)
  MODIFY_REG(PWR->CR2, (PWR_CR2_SRAM1PDS1 | PWR_CR2_SRAM1PDS2 |\
                        PWR_CR2_SRAM1PDS3 | PWR_CR2_SRAM1PDS4 | PWR_CR2_SRAM1PDS567),
                        ((~SRAM1PageRetention) & (PWR_CR2_SRAM1PDS1 | PWR_CR2_SRAM1PDS2 |\
                        PWR_CR2_SRAM1PDS3 | PWR_CR2_SRAM1PDS4 | PWR_CR2_SRAM1PDS567)));
#else
  MODIFY_REG(PWR->CR2, PWR_CR2_SRAM1PDS1, ((~SRAM1PageRetention) & PWR_CR2_SRAM1PDS1));
#endif /* defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT) */
}

/**
  * @brief  Get the SRAM1 page(s) retention in Stop mode.
  * @rmtoll CR2           SRAM1PDS1       LL_PWR_GetSRAM1StopRetention
#if defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT)
  * @rmtoll CR2           SRAM1PDS2       LL_PWR_GetSRAM1StopRetention
  * @rmtoll CR2           SRAM1PDS3       LL_PWR_GetSRAM1StopRetention
  * @rmtoll CR2           SRAM1PDS4       LL_PWR_GetSRAM1StopRetention
  * @rmtoll CR2           SRAM1PDS567     LL_PWR_GetSRAM1StopRetention
#endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_SRAM1_STOP_NO_RETENTION
#if defined(PWR_STOP2_SUPPORT)
            @arg @ref LL_PWR_SRAM1_STOP_PAGE1_RETENTION
#if !defined(PWR_STOP3_SUPPORT)
            @arg @ref LL_PWR_SRAM1_STOP_PAGE2_RETENTION
            @arg @ref LL_PWR_SRAM1_STOP_PAGE3_RETENTION
            @arg @ref LL_PWR_SRAM1_STOP_PAGE4_RETENTION
            @arg @ref LL_PWR_SRAM1_STOP_PAGE567_RETENTION
#endif
#endif
  *         @arg @ref LL_PWR_SRAM1_STOP_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetSRAM1StopRetention(void)
{
#if defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT)
  return ((~(READ_BIT(PWR->CR2, (PWR_CR2_SRAM1PDS1 | PWR_CR2_SRAM1PDS2 |\
                                PWR_CR2_SRAM1PDS3 | PWR_CR2_SRAM1PDS4 | PWR_CR2_SRAM1PDS567)))) &\
                                (PWR_CR2_SRAM1PDS1 | PWR_CR2_SRAM1PDS2 | PWR_CR2_SRAM1PDS3 |\
                                PWR_CR2_SRAM1PDS4 | PWR_CR2_SRAM1PDS567));
#else
  return ((~(READ_BIT(PWR->CR2, PWR_CR2_SRAM1PDS1))) & PWR_CR2_SRAM1PDS1);
#endif /* defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT) */
}

/**
  * @brief  Set the SRAM2 page(s) retention in Stop mode.
  * @rmtoll CR2           SRAM2PDS1       LL_PWR_SetSRAM2StopRetention
#if defined(PWR_STOP3_SUPPORT)
  * @rmtoll CR2           SRAM2PDS2       LL_PWR_SetSRAM2StopRetention
#endif
  * @param  SRAM2PageRetention  This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SRAM2_STOP_NO_RETENTION
#if defined(PWR_STOP3_SUPPORT)
  *         @arg @ref LL_PWR_SRAM2_STOP_PAGE1_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_PAGE2_RETENTION
#endif
  *         @arg @ref LL_PWR_SRAM2_STOP_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSRAM2StopRetention(uint32_t SRAM2PageRetention)
{
#if defined(PWR_STOP3_SUPPORT)
  MODIFY_REG(PWR->CR2, (PWR_CR2_SRAM2PDS1 | PWR_CR2_SRAM2PDS2),
                       ((~SRAM2PageRetention) & (PWR_CR2_SRAM2PDS1 | PWR_CR2_SRAM2PDS2)));
#else
  MODIFY_REG(PWR->CR2, PWR_CR2_SRAM2PDS1, ((~SRAM2PageRetention) & PWR_CR2_SRAM2PDS1));
#endif /* defined(PWR_STOP3_SUPPORT) */
}

/**
  * @brief  Get the SRAM2 page(s) retention in Stop mode.
  * @rmtoll CR2           SRAM2PDS1       LL_PWR_GetSRAM2StopRetention
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_SRAM2_STOP_NO_RETENTION
#if defined(PWR_STOP3_SUPPORT)
  *         @arg @ref LL_PWR_SRAM2_STOP_PAGE1_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_PAGE2_RETENTION
#endif
  *         @arg @ref LL_PWR_SRAM2_STOP_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetSRAM2StopRetention(void)
{
#if defined(PWR_STOP3_SUPPORT)
  return ((~(READ_BIT(PWR->CR2, (PWR_CR2_SRAM2PDS1 | PWR_CR2_SRAM2PDS2)))) & (PWR_CR2_SRAM2PDS1 | PWR_CR2_SRAM2PDS2));
#else
  return ((~(READ_BIT(PWR->CR2, PWR_CR2_SRAM2PDS1))) & PWR_CR2_SRAM2PDS1);
#endif /* defined(PWR_STOP3_SUPPORT) */
}

