stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_ll_pwr.h
#if defined (PWR_CR2_ICRAMPDS)
/**
  * @brief  Set the ICACHE SRAM page(s) retention in Stop mode.
  * @rmtoll CR2           ICRAMPDS        LL_PWR_SetICacheRAMStopRetention
#if defined(STM32WBAXX_SI_CUT1_0)
  * @note   On Silicon Cut 1.0, it is mandatory to disable the ICACHE before going into
  *         stop modes otherwise an hard fault may occur when waking up from stop modes.
#endif
  * @param  ICRAMPageRetention  This parameter can be one of the following values:
  *         @arg @ref LL_PWR_ICACHERAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_ICACHERAM_STOP_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetICacheRAMStopRetention(uint32_t ICRAMPageRetention)
{
  MODIFY_REG(PWR->CR2, PWR_CR2_ICRAMPDS, ((~ICRAMPageRetention) & PWR_CR2_ICRAMPDS));
}

/**
  * @brief  Get the ICACHE SRAM page(s) retention in Stop mode.
  * @rmtoll CR2           ICRAMPDS        LL_PWR_GetICacheRAMStopRetention
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_ICACHERAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_ICACHERAM_STOP_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetICacheRAMStopRetention(void)
{
  return ((~(READ_BIT(PWR->CR2, PWR_CR2_ICRAMPDS))) & PWR_CR2_ICRAMPDS);
}
#endif /* PWR_CR2_ICRAMPDS */

#if defined(PWR_STOP2_SUPPORT)
#if defined(USB_OTG_HS)
/**
  * @brief  Set the USB_OTG_HS SRAM retention in Stop mode.
  * @rmtoll CR2           PRAMPDS         LL_PWR_SetOTGHSRAMStopRetention
  * @param  OTGHSRAMRetention  This parameter can be one of the following values:
  *         @arg @ref LL_PWR_USB_OTG_HS_SRAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_USB_OTG_HS_SRAM_STOP_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetOTGHSRAMStopRetention(uint32_t OTGHSRAMRetention)
{
  MODIFY_REG(PWR->CR2, PWR_CR2_PRAMPDS, ((~OTGHSRAMRetention) & PWR_CR2_PRAMPDS));
}

/**
  * @brief  Get the USB_OTG_HS SRAM retention in Stop mode.
  * @rmtoll CR2           PRAMPDS         LL_PWR_GetOTGHSRAMStopRetention
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_USB_OTG_HS_SRAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_USB_OTG_HS_SRAM_STOP_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetOTGHSRAMStopRetention(void)
{
  return ((~(READ_BIT(PWR->CR2, PWR_CR2_PRAMPDS))) & PWR_CR2_PRAMPDS);
}
#else

#if defined(PWR_CR2_PRAMPDS)
/**
  * @brief  Set the USB SRAM retention in Stop mode.
  * @rmtoll CR2           PRAMPDS         LL_PWR_SetUSBRAMStopRetention
  * @param  USBRAMRetention  This parameter can be one of the following values:
  *         @arg @ref LL_PWR_USB_SRAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_USB_SRAM_STOP_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetUSBRAMStopRetention(uint32_t USBRAMRetention)
{
  MODIFY_REG(PWR->CR2, PWR_CR2_PRAMPDS, ((~USBRAMRetention) & PWR_CR2_PRAMPDS));
}

/**
  * @brief  Get the USB SRAM retention in Stop mode.
  * @rmtoll CR2           PRAMPDS         LL_PWR_GetUSBRAMStopRetention
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_USB_SRAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_USB_SRAM_STOP_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetUSBRAMStopRetention(void)
{
  return ((~(READ_BIT(PWR->CR2, PWR_CR2_PRAMPDS))) & PWR_CR2_PRAMPDS);
}
#endif /* defined(PWR_CR2_PRAMPDS) */
#endif /* defined(USB_OTG_HS) */

/**
  * @brief  Set the PKA SRAM retention in Stop mode.
  * @rmtoll CR2           PKARAMPDS       LL_PWR_SetPKARAMStopRetention
  * @param  PKASRAMRetention  This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PKARAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_PKARAM_STOP_FULL_RETENTION
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPKARAMStopRetention(uint32_t PKASRAMRetention)
{
  MODIFY_REG(PWR->CR2, PWR_CR2_PKARAMPDS, ((~PKASRAMRetention) & PWR_CR2_PKARAMPDS));
}

/**
  * @brief  Get the PKA SRAM retention in Stop mode.
  * @rmtoll CR2           PKARAMPDS       LL_PWR_GetPKARAMStopRetention
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_PKARAM_STOP_NO_RETENTION
  *         @arg @ref LL_PWR_PKARAM_STOP_FULL_RETENTION
  */
__STATIC_INLINE uint32_t LL_PWR_GetPKARAMStopRetention(void)
{
  return ((~(READ_BIT(PWR->CR2, PWR_CR2_PKARAMPDS))) & PWR_CR2_PKARAMPDS);
}
#endif /* defined(PWR_STOP2_SUPPORT) */

/**
  * @brief  Enable the flash memory fast wakeup from Stop mode (Stop 0, 1).
  * @rmtoll CR2           FLASHFWU        LL_PWR_EnableFlashFastWakeUp
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableFlashFastWakeUp(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_FLASHFWU);
}

/**
  * @brief  Disable the flash memory fast wakeup from Stop mode (Stop 0, 1).
  * @rmtoll CR2           FLASHFWU        LL_PWR_DisableFlashFastWakeUp
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableFlashFastWakeUp(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_FLASHFWU);
}

/**
  * @brief  Check if the flash memory fast wakeup from Stop mode (Stop 0, 1) is enabled.
  * @rmtoll CR2           FLASHFWU        LL_PWR_IsEnabledFlashFastWakeUp
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledFlashFastWakeUp(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_FLASHFWU) == (PWR_CR2_FLASHFWU)) ? 1UL : 0UL);
}

#if defined(PWR_CR3_REGSEL)
/**
  * @brief  Set the VCore regulator supply.
  * @rmtoll CR3           REGSEL          LL_PWR_SetRegulatorSupply
  * @param  RegulatorSupply This parameter can be one of the following values:
  *         @arg @ref LL_PWR_LDO_SUPPLY
  *         @arg @ref LL_PWR_SMPS_SUPPLY
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetRegulatorSupply(uint32_t RegulatorSupply)
{
  MODIFY_REG(PWR->CR3, PWR_CR3_REGSEL, RegulatorSupply);
}

/**
  * @brief  Get the VCore regulator supply.
  * @rmtoll CR3           REGSEL          LL_PWR_GetRegulatorSupply
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_LDO_SUPPLY
  *         @arg @ref LL_PWR_SMPS_SUPPLY
  */
__STATIC_INLINE uint32_t LL_PWR_GetRegulatorSupply(void)
{
  return (READ_BIT(PWR->CR3, PWR_CR3_REGSEL));
}
#endif /* PWR_CR3_REGSEL */

#if defined(PWR_CR2_FPWM)
/**
  * @brief  Enable the SMPS PWM mode.
  * @rmtoll CR2           FPWM            LL_PWR_EnableSMPSPWMMode
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableSMPSPWMMode(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_FPWM);
}

/**
  * @brief  Disable the SMPS PWM mode.
  * @rmtoll CR2           FPWM            LL_PWR_DisableSMPSPWMMode
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableSMPSPWMMode(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_FPWM);
}

/**
  * @brief  Check if the SMPS PWM mode is enabled.
  * @rmtoll CR2           FPWM            LL_PWR_IsEnabledSMPSPWMMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSMPSPWMMode(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_FPWM) == (PWR_CR2_FPWM)) ? 1UL : 0UL);
}
#endif /* PWR_CR2_FPWM */

/**
  * @brief  Enable the fast soft start for selected regulator.
  * @rmtoll CR3           FSTEN           LL_PWR_EnableFastSoftStart
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableFastSoftStart(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_FSTEN);
}

/**
  * @brief  Disable the fast soft start for selected regulator.
  * @rmtoll CR3           FSTEN           LL_PWR_DisableFastSoftStart
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableFastSoftStart(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_FSTEN);
}

/**
  * @brief  Check if the fast soft start for selected regulator is enabled.
  * @rmtoll CR3           FSTEN           LL_PWR_IsEnabledFastSoftStart
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledFastSoftStart(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_FSTEN) == (PWR_CR3_FSTEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the regulator supply output voltage.
  * @rmtoll VOSR          VOS             LL_PWR_SetRegulVoltageScaling
  * @param  VoltageScaling This parameter can be one of the following values:
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE1
#if defined(PWR_STOP3_SUPPORT)
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE1_5
#endif
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetRegulVoltageScaling(uint32_t VoltageScaling)
{
  MODIFY_REG(PWR->VOSR, PWR_VOSR_VOS, VoltageScaling);
}

/**
  * @brief  Get the regulator supply output voltage.
  * @rmtoll VOSR          VOS             LL_PWR_GetRegulVoltageScaling
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE1
#if defined(PWR_STOP3_SUPPORT)
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE1_5
#endif
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE2
  */
__STATIC_INLINE uint32_t LL_PWR_GetRegulVoltageScaling(void)
{
  return (uint32_t)(READ_BIT(PWR->VOSR, PWR_VOSR_VOS));
}
#if defined(PWR_STOP2_SUPPORT)
#if defined(USB_OTG_HS)
/**
  * @brief  Set the clocked delay between VDD11USBDIS and VDD11USBRDY.
  * @rmtoll VOSR          VDD11USBSWDLY   LL_PWR_SetVdd11UsbSwitchDelay
  * @param  Delay : Specifies the delay in system clock cycles.
  *                 This parameter can be a value between 0 to 1023.
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetVdd11UsbSwitchDelay(uint32_t Delay)
{
  MODIFY_REG(PWR->VOSR, PWR_VOSR_VDD11USBSWDLY, (Delay << PWR_VOSR_VDD11USBSWDLY_Pos));
}

/**
  * @brief  Get the clocked delay between VDD11USBDIS and VDD11USBRDY.
  * @rmtoll VOSR          VDD11USBSWDLY   LL_PWR_GetVdd11UsbSwitchDelay
  * @retval Returned the delay in system clock cycles.
  */
__STATIC_INLINE uint32_t LL_PWR_GetVdd11UsbSwitchDelay(void)
{
  return (uint32_t)((READ_BIT(PWR->VOSR, PWR_VOSR_VDD11USBSWDLY) >> PWR_VOSR_VDD11USBSWDLY_Pos));
}

/**
  * @brief  Enable the VDD11 USB.
  * @rmtoll VOSR          VDD11USBDIS     LL_PWR_EnableVdd11USB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVdd11USB(void)
{
  CLEAR_BIT(PWR->VOSR, PWR_VOSR_VDD11USBDIS);
}

/**
  * @brief  Disable the VDD11 USB.
  * @rmtoll VOSR          VDD11USBDIS     LL_PWR_DisableVdd11USB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVdd11USB(void)
{
  SET_BIT(PWR->VOSR, PWR_VOSR_VDD11USBDIS);
}

/**
  * @brief  Check if the VDD11 USB is enabled.
  * @rmtoll VOSR          VDD11USBDIS     LL_PWR_IsEnabledVdd11USB
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVdd11USB(void)
{
  return ((READ_BIT(PWR->VOSR, PWR_VOSR_VDD11USBDIS) == (PWR_VOSR_VDD11USBDIS)) ? 0UL : 1UL);
}

/**
  * @brief  Enable the USB booster.
  * @rmtoll VOSR          USBBOOSTEN      LL_PWR_EnableUSBBooster
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableUSBBooster(void)
{
  SET_BIT(PWR->VOSR, PWR_VOSR_USBBOOSTEN);
}

/**
  * @brief  Disable the USB booster.
  * @rmtoll VOSR          USBBOOSTEN      LL_PWR_DisableUSBBooster
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableUSBBooster(void)
{
  CLEAR_BIT(PWR->VOSR, PWR_VOSR_USBBOOSTEN);
}

/**
  * @brief  Check if the USB booster is enabled.
  * @rmtoll VOSR          USBBOOSTEN      LL_PWR_IsEnabledUSBBooster
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledUSBBooster(void)
{
  return ((READ_BIT(PWR->VOSR, PWR_VOSR_USBBOOSTEN) == (PWR_VOSR_USBBOOSTEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the USB OTG_HS power.
  * @rmtoll VOSR          USBPWREN        LL_PWR_EnableUSBPWR
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableUSBPWR(void)
{
  SET_BIT(PWR->VOSR, PWR_VOSR_USBPWREN);
}

/**
  * @brief  Disable the USB OTG_HS power.
  * @rmtoll VOSR          USBPWREN        LL_PWR_DisableUSBPWR
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableUSBPWR(void)
{
  CLEAR_BIT(PWR->VOSR, PWR_VOSR_USBPWREN);
}

/**
  * @brief  Check if the USB OTG_HS power is enabled.
  * @rmtoll VOSR          USBPWREN        LL_PWR_IsEnabledUSBPWR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledUSBPWR(void)
{
  return ((READ_BIT(PWR->VOSR, PWR_VOSR_USBPWREN) == (PWR_VOSR_USBPWREN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the VDDUSB supply.
  * @rmtoll VOSR          USV             LL_PWR_EnableVddUSB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddUSB(void)
{
  SET_BIT(PWR->SVMCR, PWR_SVMCR_USV);
}

/**
  * @brief  Disable the VDDUSB supply.
  * @rmtoll VOSR          USV             LL_PWR_DisableVddUSB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddUSB(void)
{
  CLEAR_BIT(PWR->SVMCR, PWR_SVMCR_USV);
}

/**
  * @brief  Check if the VDDUSB supply is enabled.
  * @rmtoll VOSR          USV             LL_PWR_IsEnabledVddUSB
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddUSB(void)
{
  return ((READ_BIT(PWR->SVMCR, PWR_SVMCR_USV) == (PWR_SVMCR_USV)) ? 1UL : 0UL);
}
#elif defined(PWR_STOP3_SUPPORT) && defined(PWR_SVMCR_USV)
/**
  * @brief  Enable the VDDUSB supply.
  * @rmtoll VOSR          USV             LL_PWR_EnableVddUSB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddUSB(void)
{
  SET_BIT(PWR->SVMCR, PWR_SVMCR_USV);
}

/**
  * @brief  Disable the VDDUSB supply.
  * @rmtoll VOSR          USV             LL_PWR_DisableVddUSB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddUSB(void)
{
  CLEAR_BIT(PWR->SVMCR, PWR_SVMCR_USV);
}

/**
  * @brief  Check if the VDDUSB supply is enabled.
  * @rmtoll VOSR          USV             LL_PWR_IsEnabledVddUSB
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddUSB(void)
{
  return ((READ_BIT(PWR->SVMCR, PWR_SVMCR_USV) == (PWR_SVMCR_USV)) ? 1UL : 0UL);
}
#endif /* defined(PWR_STOP3_SUPPORT) && defined(PWR_SVMCR_USV) */

