stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_ll_pwr.h
/**
  * @brief  Indicate whether the 2.4 GHz RADIO encryption function is enabled
  * @rmtoll RADIOSCR      ENCMODE         LL_PWR_IsEnabledRadioEncryption
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledRadioEncryption(void)
{
  return ((READ_BIT(PWR->RADIOSCR, PWR_RADIOSCR_ENCMODE) == (PWR_RADIOSCR_ENCMODE)) ? 1UL : 0UL);
}

/**
  * @brief  Get 2.4 GHz RADIO PHY operating mode.
  * @rmtoll RADIOSCR      PHYMODE         LL_PWR_GetRadioPhyMode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_RADIO_PHY_SLEEP_MODE
  *         @arg @ref LL_PWR_RADIO_PHY_STANDBY_MODE
  */
__STATIC_INLINE uint32_t LL_PWR_GetRadioPhyMode(void)
{
  return (READ_BIT(PWR->RADIOSCR, PWR_RADIOSCR_PHYMODE));
}

/**
  * @brief  Get 2.4 GHz RADIO operating mode.
  * @rmtoll RADIOSCR      MODE            LL_PWR_GetRadioMode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_RADIO_DEEP_SLEEP_MODE
  *         @arg @ref LL_PWR_RADIO_SLEEP_MODE
  *         @arg @ref LL_PWR_RADIO_ACTIVE_MODE
  */
__STATIC_INLINE uint32_t LL_PWR_GetRadioMode(void)
{
  if (READ_BIT(PWR->RADIOSCR, PWR_RADIOSCR_MODE_1) != 0UL)
  {
    return LL_PWR_RADIO_ACTIVE_MODE;
  }
  else
  {
    return (READ_BIT(PWR->RADIOSCR, PWR_RADIOSCR_MODE_0));
  }
}
/**
  * @}
  */

#if defined(PWR_STOP2_SUPPORT) && defined(PWR_S2RETR_PTASREN)
/** @defgroup PWR_LL_EF_PTA_STOP2_RETENTION_MANAGEMENT PWR PTA Stop2 Retention Management
  * @{
  */

/**
  * @brief  Enable the PTA output signals retention in Stop 2 mode.
  * @rmtoll S2RETR        PTASRE          LL_PWR_EnablePTAOutputStop2Retention
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePTAOutputStop2Retention(void)
{
  SET_BIT(PWR->S2RETR, PWR_S2RETR_PTASREN);
}

/**
  * @brief  Disable the PTA output signals retention in Stop 2 mode.
  * @rmtoll S2RETR        PTASRE          LL_PWR_DisablePTAOutputStop2Retention
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisablePTAOutputStop2Retention(void)
{
  CLEAR_BIT(PWR->S2RETR, PWR_S2RETR_PTASREN);
}

/**
  * @brief  Check if the PTA output signals retention in Stop 2 mode is enabled.
  * @rmtoll S2RETR        PTASRE          LL_PWR_IsEnabledPTAOutputStop2Retention
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPTAOutputStop2Retention(void)
{
  return ((READ_BIT(PWR->S2RETR, PWR_S2RETR_PTASREN) == (PWR_S2RETR_PTASREN)) ? 1UL : 0UL);
}
/**
  * @}
  */
#endif /* PWR_STOP2_SUPPORT && PWR_S2RETR_PTASREN */

/** @defgroup PWR_LL_EF_FLAG_MANAGEMENT PWR FLAG Management
  * @{
  */

/**
  * @brief  Indicate whether the regulator voltage output is above voltage
  *         scaling range or not.
  * @rmtoll VOSR          VOSRDY          LL_PWR_IsActiveFlag_VOS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VOS(void)
{
  return ((READ_BIT(PWR->VOSR, PWR_VOSR_VOSRDY) == (PWR_VOSR_VOSRDY)) ? 1UL : 0UL);
}

#if defined(PWR_STOP2_SUPPORT)
#if defined(USB_OTG_HS)
/**
  * @brief  Indicate whether the VDD11 USB is ready or not.
  * @rmtoll SVMSR         VDD11USBRDY     LL_PWR_IsActiveFlag_VDD11USBRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VDD11USBRDY(void)
{
  return ((READ_BIT(PWR->VOSR, PWR_VOSR_VDD11USBRDY) == (PWR_VOSR_VDD11USBRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the USB booster is ready or not.
  * @rmtoll SVMSR         USBBOOSTRDY     LL_PWR_IsActiveFlag_USBBOOSTRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_USBBOOSTRDY(void)
{
  return ((READ_BIT(PWR->VOSR, PWR_VOSR_USBBOOSTRDY) == (PWR_VOSR_USBBOOSTRDY)) ? 1UL : 0UL);
}
#endif /* defined(USB_OTG_HS) */
#endif /* defined(PWR_STOP2_SUPPORT) */

/**
  * @brief  Indicate whether the system was in standby mode or not.
  * @rmtoll SR            SBF             LL_PWR_IsActiveFlag_SB
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_SB(void)
{
  return ((READ_BIT(PWR->SR, PWR_SR_SBF) == (PWR_SR_SBF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the system was in stop mode or not.
  * @rmtoll SR            STOPF           LL_PWR_IsActiveFlag_STOP
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_STOP(void)
{
  return ((READ_BIT(PWR->SR, PWR_SR_STOPF) == (PWR_SR_STOPF)) ? 1UL : 0UL);
}

#if defined(PWR_STOP2_SUPPORT)
/**
  * @brief  Indicate whether the system was in stop2 mode or not.
  * @rmtoll SR            STOP2F          LL_PWR_IsActiveFlag_STOP2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_STOP2(void)
{
  return ((READ_BIT(PWR->SR, PWR_SR_STOP2F) == (PWR_SR_STOP2F)) ? 1UL : 0UL);
}
#endif /* defined(PWR_STOP2_SUPPORT) */

#if defined(PWR_SVMSR_REGS)
/**
  * @brief  Indicate whether the regulator supply is LDO or SMPS.
  * @rmtoll SVMSR         REGS            LL_PWR_IsActiveFlag_REGULATOR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_REGULATOR(void)
{
  return ((READ_BIT(PWR->SVMSR, PWR_SVMSR_REGS) == (PWR_SVMSR_REGS)) ? 1UL : 0UL);
}
#endif /* PWR_SVMSR_REGS */

/**
  * @brief  Indicate whether the VDD voltage is below the threshold or not.
  * @rmtoll SVMSR         PVDO            LL_PWR_IsActiveFlag_PVDO
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_PVDO(void)
{
  return ((READ_BIT(PWR->SVMSR, PWR_SVMSR_PVDO) == (PWR_SVMSR_PVDO)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the regulator voltage output is equal to current
  *         used voltage scaling range or not.
  * @rmtoll SVMSR         ACTVOSRDY       LL_PWR_IsActiveFlag_ACTVOS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_ACTVOS(void)
{
  return ((READ_BIT(PWR->SVMSR, PWR_SVMSR_ACTVOSRDY) == (PWR_SVMSR_ACTVOSRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 1.
  * @rmtoll WUSR          WUF1            LL_PWR_IsActiveFlag_WU1
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU1(void)
{
  return ((READ_BIT(PWR->WUSR, PWR_WUSR_WUF1) == (PWR_WUSR_WUF1)) ? 1UL : 0UL);
}

#if defined(PWR_WUSR_WUF2)
/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 2.
  * @rmtoll WUSR          WUF2            LL_PWR_IsActiveFlag_WU2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU2(void)
{
  return ((READ_BIT(PWR->WUSR, PWR_WUSR_WUF2) == (PWR_WUSR_WUF2)) ? 1UL : 0UL);
}
#endif /* PWR_WUSR_WUF2 */

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 3.
  * @rmtoll WUSR          WUF3            LL_PWR_IsActiveFlag_WU3
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU3(void)
{
  return ((READ_BIT(PWR->WUSR, PWR_WUSR_WUF3) == (PWR_WUSR_WUF3)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 4.
  * @rmtoll WUSR          WUF4            LL_PWR_IsActiveFlag_WU4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU4(void)
{
  return ((READ_BIT(PWR->WUSR, PWR_WUSR_WUF4) == (PWR_WUSR_WUF4)) ? 1UL : 0UL);
}

